import com.sun.istack.internal.Nullable;
import com.sun.javafx.collections.ElementObservableListDecorator;

import java.text.Collator;
import java.util.*;

public class main {
     public static ArrayList<String> output = new ArrayList<>();
  public static void main(String[] args) {
    //导入文言文   
    divide("鹤鸣于九皋，声闻于野。鱼潜在渊，或在于渚。乐彼之园，爰有树檀，其下维萚。他山之石，可以为错,鹤鸣于九皋，声闻于天。鱼在于渚，或潜在渊。乐彼之园，爰有树檀，其下维榖。他山之石，可以攻玉。","2");
    divide("春江潮水连海平，海上明月共潮生。滟滟随波千万里，何处春江无月明！江流宛转绕芳甸，月照花林皆似霰；空里流霜不觉飞，汀上白沙看不见。江天一色无纤尘，皎皎空中孤月轮。江畔何人初见月？江月何年初照人？人生代代无穷已，江月年年望相似。不知江月待何人，但见长江送流水。白云一片去悠悠，青枫浦上不胜愁。谁家今夜扁舟子？何处相思明月楼？可怜楼上月裴回，应照离人妆镜台。玉户帘中卷不去，捣衣砧上拂还来。此时相望不相闻，愿逐月华流照君。鸿雁长飞光不度，鱼龙潜跃水成文。昨夜闲潭梦落花，可怜春半不还家。江水流春去欲尽，江潭落月复西斜。斜月沉沉藏海雾，碣石潇湘无限路。不知乘月几人归，落月摇情满江树。","5");
    divide("风急天高猿啸哀，渚清沙白鸟飞回。无边落木萧萧下，不尽长江滚滚来。万里悲秋常作客，百年多病独登台。艰难苦恨繁霜鬓，潦倒新停浊酒杯。","10");
    divide("六朝文物草连空，天淡云闲今古同。鸟去鸟来山色里，人歌人哭水声中。深秋帘幕千家雨，落日楼台一笛风。惆怅无日见范蠡，参差烟树五湖东。","13");
    divide("碧云天，黄叶地，秋色连波，波上寒烟翠。山映斜阳天接水，芳草无情，更在斜阳外。黯乡魂，追旅思，夜夜除非，好梦留人睡。明月楼高休独倚，酒入愁肠，化作相思泪。","16");
    divide("孙子曰：兵者，国之大事，死生之地，存亡之道，不可不察也。故经之以五事，校之以计而索其情：一曰道，二曰天，三曰地，四曰将，五曰法。道者，令民与上同意也，故可以与之死，可以与之生，而不畏危。天者，阴阳、寒暑、时制也。地者，远近、险易、广狭、死生也。将者，智、信、仁、勇、严也。法者，曲制、官道、主用也。凡此五者，将莫不闻，知之者胜，不知者不胜。故校之以计，而索其情，曰：主孰有道？将孰有能？天地孰得？法令孰行？兵众孰强？士卒孰练？赏罚孰明？吾以此知胜负矣。将听吾计，用之必胜，留之；将不听吾计，用之必败，去之。","20");
    divide("张衡字平子，南阳西鄂人也。衡少善属文，游于三辅，因入京师，观太学，遂通五经，贯六艺。虽才高于世，而无骄尚之情。常从容淡静，不好交接俗人。永元中，举孝廉不行，连辟公府不就。时天下承平日久，自王侯以下，莫不逾侈。衡乃拟班固《两都》作《二京赋》，因以讽谏。精思傅会，十年乃成。大将军邓骘奇其才，累召不应。衡善机巧，尤致思于天文、阴阳、历算。安帝雅闻衡善术学，公车特征拜郎中，再迁为太史令。遂乃研核阴阳，妙尽璇玑之正，作浑天仪，著《灵宪》、《算罔论》，言甚详明。阳嘉元年，复造候风地动仪。以精铜铸成，员径八尺，合盖隆起，形似酒尊，饰以篆文山龟鸟兽之形。中有都柱，傍行八道，施关发机。外有八龙，首衔铜丸，下有蟾蜍，张口承之。其牙机巧制，皆隐在尊中，覆盖周密无际。如有地动，尊则振龙，机发吐丸，而蟾蜍衔之。振声激扬，伺者因此觉知。虽一龙发机，而七首不动，寻其方面，乃知震之所在。验之以事，合契若神。自书典所记，未之有也。尝一龙机发而地不觉动，京师学者咸怪其无征。后数日驿至，果地震陇西，于是皆服其妙。自此以后，乃令史官记地动所从方起。","23");
    divide("盖神农为耒耜，以利天下;尧命四子，敬授民时;舜命后稷，食为政首;禹制土田，万国作乂;殷周之盛，诗书所述，要在安民，富而教之。《仲长子》曰：天为之时，而我不农，谷亦不可得而取之。青春至焉，时雨降焉，始之耕田，终之簠、簋，惰者釜之，勤者锺之。矙夫不为，而尚乎食也哉？《谯子》曰：朝发而夕异宿九，勤则菜盈倾筐。且苟无羽毛，无纺不衣;不能茹草饮水，不耕不食。安可以不自力哉？神农、仓颉，圣人者也;其于事也，有所不能矣。故赵过始为牛耕，实胜耒耜之利;蔡伦立意造纸，岂方绎、牍之烦？且耿寿昌之常平仓，桑弘羊之均输法，益国利民，不朽之术也。谚曰：智如禹、汤，不如尝更。是以樊迟请学稼，孔子答曰：吾不如老农。然则圣贤之智，犹有所未达，而况于凡庸者乎？","28");
    divide("予奉使河北，遵太行而北，山崖之间，往往衔螺蚌壳及石子如鸟卵者，横亘石壁如带。此乃昔之海滨，今东距海已近千里。所谓大陆者，皆浊泥所湮耳。尧殛鲧于羽山，旧说在东海中，今乃在平陆。凡大河、漳水、滹沱、涿水、桑干之类，悉是浊流。今关、陕以西，水行地中不减百余尺。其泥岁东流，皆为大陆之土，此理必然。","31");
    divide("按其发源，河自昆仑之北，江亦自昆仑之南，其远亦同也。发于北者曰星宿海，佛经谓之徙多河。北流经积石，始东折入宁夏，为河套，又南曲为龙门大河，而与渭合。发于南者曰犁牛石，佛经谓之殑伽河。南流经石门关，始东折而入丽江，为金沙江，又北曲为叙州大江，与岷山之江合。余按岷江经成都至叙，不及千里，金沙江经丽江、云南、乌蒙至叙，共二千余里，舍远而宗近，岂其源独与河异乎？非也！河源屡经寻讨，故始得其远；江源从无问津，故仅宗其近。其实岷之入江，与渭之入河，皆中国之支流，而岷江为舟楫所通，金沙江盘折蛮僚谿峒间，水陆俱莫能溯。在叙州者，只知其水出于马湖、乌蒙，而不知上流之由云南、丽江；在云南、丽江者，知其为金沙江而不知下流之出叙为江源。云南亦有二金沙江：一南流北转，即此江，乃佛经所谓殑伽河也；一南流下海，即王靖远征麓川，缅人恃以为险者，乃佛经所谓信度河也。云南诸志，俱不载其出入之异，互相疑溷，尚不悉其是一是二，分北分南，又何由辨其为源与否也。既不悉其孰远孰近，第见《禹贡》“岷山导江”之文，遂以江源归之，而不知禹之导，乃其为害于中国之始，非其滥觞发脉之始也。导河自积石，而河源不始于积石；导江自岷山，而江源亦不出于岷山。岷流入江，而未始为江源，正如渭流入河，而未始为河源也。不第此也，岷流之南，又有大渡河，西自吐蕾，经黎、雅与岷江合，在金沙江西北，其源亦长于岷而不及金沙，故推江源者，必当以金沙为首。","34");
    divide("子禽问于子贡曰：夫子至于是邦也，必闻其政，求之与，抑与之与？子贡曰：夫子温、良、恭、俭、让以得之。夫子之求之也，其诸异乎人之求之与？子曰：君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。子贡曰：“贫而无谄，富而无骄，何如？”子曰：“可也。未若贫而乐，富而好礼者也。”子贡曰：“《诗》云：‘如切如磋，如琢如磨’，其斯之谓与？”子曰：“赐也，始可与言《诗》已矣，告诸往而知来者。”","40");
    divide("子曰：“饭疏食饮水，曲肱而枕之，乐亦在其中矣。不义而富且贵，于我如浮云。”叶公问孔子于子路，子路不对。子曰：“女奚不曰，其为人也，发愤忘食，乐以忘忧，不知老之将至云尔。”","44");
    divide("天命之谓性，率性之谓道，修道之谓教。道也者，不可须臾离也，可离非道也。是故君子戒慎乎其所不睹，恐惧乎其所不闻。莫见乎隐，莫显乎微，故君子慎其独也。喜怒哀乐之未发，谓之中；发而皆中节，谓之和；中也者，天下之大本也；和也者，天下之达道也。致中和，天地位焉，万物育焉。","47");
    divide("初，膺与廷尉冯绲、大司农刘祐等共同心志，纠罚奸幸。时，张让弟朔为野王令，贫残无道，至乃杀孕妇，闻膺厉威严，惧罪逃还京师，因匿兄让弟舍，藏于合柱中。膺知其状，率将吏卒破柱取朔，付洛阳狱。受辞毕，即杀之。让诉冤于帝，诏膺八殿，御亲临轩，诘以不先请便加诛辟之意。膺对曰：“昔晋文公执卫成公归于京师，《春秋》是焉。《礼》云公族有罪，虽曰宥之，有司执宪不从。昔仲尼为鲁司寇，七日而诛少正卯。今臣到官已积一旬，私惧以稽留为愆，不意获速疾之罪。诚自知衅责，死不旋踵，特乞留五日，克殄元恶，退就鼎镬，始生之意也。”帝无复言，顾谓让曰：“此汝弟之罪，司隶何愆？”乃遣出之。自此诸黄门常侍皆鞠躬屏气，休沐不敢复出宫省。帝怪问其故，并叩头泣曰：“畏李校尉。”","50");
    divide("钟士季精有才理，先不识嵇康；钟要于时贤俊之士，俱往寻康。康方大树下锻，向子期为佐鼓排。康扬槌不辍，傍若无人，移时不交一言。钟起去，康曰：“何所闻而来？何所见而去？”钟曰：“闻所闻而来，见所见而去。”嵇中散临刑东市,神气不变。索琴弹之,奏《陵散》。曲终,曰：“袁孝尼尝请学此散,吾靳固未与,《广陵散》于今绝矣!”太学生三千人上书,请以为师,不许。文王寻亦悔焉。","53");
    divide("岂曰无衣？与子同袍。王于兴师，修我戈矛，与子同仇!岂曰无衣？与子同泽。王于兴师，修我矛戟，与子偕作!岂曰无衣？与子同裳。王于兴师，修我甲兵，与子偕行！","58");
    divide("子游问孝，子曰：“今之孝者，是谓能养。至于犬马，皆能有养。不敬，何以别乎？”孟懿子问孝，子曰：“无违。”樊迟御，子告之曰：“孟孙问孝于我，我对曰‘无违’。”樊迟曰：“何谓也？”子曰：“生，事之以礼；死，葬之以礼，祭之以礼。”子夏问孝。子曰：“色难。有事，弟子服其劳；有酒食，先生馔，曾是以为孝乎？”子夏曰：“事父母，能竭其力‘子曰：“事父母几谏，见志不从，又敬不违，劳而不怨。”","61");
    divide("迁生龙门，耕牧河山之阳。年十岁则诵古文。二十而南游江、淮，上会稽，探禹穴，窥九疑，浮沅、湘。北涉汶、泗，讲业齐鲁之都，观夫子遗风，乡射邹峄;厄困蕃、薛、彭城，过梁、楚以归。于是迁仕为郎中，奉使西征巴、蜀以南，略邛、莋、昆明，还报命。是岁，天子始建汉家之封，而太史公留滞周南，不得与从事，发愤且卒。而子迁适反，见父于河、洛之间。太史公执迁手而泣曰：“予先，周室之太史也。自上世尝显功名虞、夏，典天官事。后世中衰，绝于予乎?汝复为太史，则续吾祖矣。今天子接千岁之统，封泰山，而予不得从行，是命也夫!命也夫!予死，尔必为太史;为太史，毋忘吾所欲论著矣。且夫孝，始于事亲，中于事君，终于立身;扬名于后世，以显父母，此孝之大也。夫天下称周公，言其能论歌文、武之德，宣周、召之风，达大王、王季思虑，爰及公刘，以尊后稷也。幽、厉之后，王道缺，礼乐衰，孔子修旧起废，论《诗》、《书》，作《春秋》，则学者至今则之。自获麟以来四百有余岁，而诸侯相兼，史记放绝。今汉兴，海内一统，明主贤君，忠臣义士，予为太史而不论载，废天下之文，予甚惧焉，尔其念哉!”迁俯首流涕曰：“小子不敏，请悉论先人所次旧闻，弗敢阙。”","65");
    divide("少年十五二十时，步行夺得胡马骑。 射杀山中白额虎，肯数邺下黄须儿！ 一身转战三千里，一剑曾当百万师。 汉兵奋迅如霹雳，虏骑崩腾畏蒺藜。 卫青不败由天幸，李广无功缘数奇。 自从弃置便衰朽，世事蹉跎成白首。 昔时飞箭无全目，今日垂杨生左肘。 路旁时卖故侯瓜，门前学种先生柳。 苍茫古木连穷巷，寥落寒山对虚牖。 誓令疏勒出飞泉，不似颍川空使酒。 贺兰山下阵如云，羽檄交驰日夕闻。 节使三河募年少，诏书五道出将军。 试拂铁衣如雪色，聊持宝剑动星文。 愿得燕弓射天将，耻令越甲鸣吾军。 莫嫌旧日云中守，犹堪一战取功勋。","69");
    divide("有亡国，有亡天下，亡国与亡天下奚辩?曰：易姓改号，谓之亡国；仁义充塞而至于率兽食人，人将相食，谓之亡天下。是故知保天下，然后知保其国。保国者，其君其臣、肉食者谋之；保天下者，匹夫之贱，与有责焉耳矣!","73");
    divide("万物为道一偏，一物为万物一偏，愚者为一物一偏，而自以为知道，无知也。慎子有见于后，无见于先。老子有见于拙，无见于信，墨子有见于齐，无见于畸，宋子有见于少，无见于多。有后而无先，则群众无门；有诎而无信，则贵贱不分；有齐而无畸，则政令不施；有少而无多，则群众不化。《书》曰：“无有作好，遵王之道；无有作恶，遵王之路。”此之谓也。","76");
    divide("日出东方隈，似从地底来。历天又入海，六龙所舍安在哉。其始与终古不息，人非元气安得与之久裴徊。草不谢荣于春风，木不怨落于秋天。谁挥鞭策驱四运，万物兴歇皆自然。羲和羲和，汝奚汩没于荒淫之波。鲁阳何德，驻景挥戈。逆道违天，矫诬实多。吾将囊括大块，浩然与溟涬同科。","78");
    divide("赠君一法决狐疑，不用钻龟与祝蓍。试玉要烧三日满，辨材须待七年期。周公恐惧流言日，王莽谦恭未篡时。向使当初身便死，一生真伪复谁知？","82");
    divide("杭有卖果者，善藏柑，涉寒暑不溃。出之烨然，玉质而金色。置于市，贾十倍，人争鬻之。予贸得其一，剖之，如有烟扑口鼻，视其中，则干若败絮。予怪而问之曰：“若所市于人者，将以实笾豆，奉祭祀，供宾客乎？将炫外以惑愚瞽也？甚矣哉，为欺也！”卖者笑曰：“吾业是有年矣，吾赖是以食吾躯。吾售之，人取之，未尝有言，而独不足子所乎？世之为欺者不寡矣，而独我也乎？吾子未之思也。今夫佩虎符、坐皋比者，洸洸乎干城之具也，果能授孙、吴之略耶？峨大冠、拖长绅者，昂昂乎庙堂之器也，果能建伊、皋之业耶？盗起而不知御，民困而不知救，吏奸而不知禁，法斁而不知理，坐糜廪粟而不知耻。观其坐高堂，骑大马，醉醇醴而饫肥鲜者，孰不巍巍乎可畏，赫赫乎可象也？又何往而不金玉其外，败絮其中也哉？今子是之不察，而以察吾柑！”予默默无以应。退而思其言，类东方生滑稽之流。岂其愤世疾邪者耶？而托于柑以讽耶？","85");
    divide("看破浮生过半，半之受用无边。半中岁月尽幽闲，半里乾坤宽展。半郭半乡村舍，半山半水田园。半耕半读半经廛，半士半民姻眷。半雅半粗器具，半华半实庭轩。衾裳半素半轻鲜，肴馔半丰半俭。童仆半能半拙，妻儿半朴半贤。心情半佛半神仙，姓字半藏半显。一半还之天地，让将一半人间，半思后代与沧田，半想阎罗怎见。酒饮半酣正好，花开半时偏妍。帆张半扇免翻颠，马放半缰稳便。半少却饶滋味，半多反厌纠缠。百年苦乐半相参，会占便宜只半。","88");
    divide("天下皆知美之為美，斯恶已。皆知善之為善，斯不善已。有无相生，难易相成，长短相形，高下相盈，音声相和，前后相随。恒也。是以圣人处无為之事，行不言之教；万物作而弗始，生而弗有，為而弗恃，功成而不居。夫唯弗居，是以不去。","92");
    divide("上善若水。水善利万物而不争，处众人之所恶，故几于道。居善地，心善渊，与善仁，言善信，政善治，事善能，动善时。夫唯不争，故无尤。","95");
    divide("秋水时至，百川灌河；泾流之大，两涘渚崖之间不辩牛马。于是焉河伯欣然自喜，以天下之美为尽在己。顺流而东行，至于北海，东面而视，不见水端。于是焉河伯始旋其面目，望洋向若而叹曰：“野语有之曰：‘闻道百，以为莫己若者。’我之谓也。且夫我尝闻少仲尼之闻，而轻伯夷之义者，始吾弗信，今我睹子之难穷也，吾非至于子之门则殆矣。吾长见笑于大方之家。”","97");
    divide("昔者庄周梦为胡蝶，栩栩然胡蝶也。自喻适志与！不知周也。俄然觉，则蘧蘧然周也。不知周之梦为胡蝶与？胡蝶之梦为周与？周与胡蝶则必有分矣。此之谓物化","100");
    divide("留侯美好如妇人，五世相韩韩入秦。倾家为主合壮士，博浪沙中击秦帝。脱身下邳世不知，举国大索何能为。素书一卷天与之，谷城黄石非吾师。固陵解鞍聊出口，捕取项羽如婴儿。从来四皓招不得，为我立弃商山芝。洛阳贾谊才能薄，扰扰空令绛灌疑。","102");
    //按拼音首字母排序
    Comparator comparator = Collator.getInstance(Locale.CHINA);
    Collator collator = Collator.getInstance();
    output.sort(collator::compare);
    LinkedHashSet<String> hashSet= new LinkedHashSet<>(output);

      hashSet.stream().forEach(System.out::println);
      System.out.println("数目"+hashSet.size());

  }
  private static void divide(String str, String page) {
    //分隔符   
    String split = "\\pP|\\pS|\\pZ";
    //排查文本中空白字符
    str.replaceAll(" ","");
    str.split(" ");
    //分割
    List<String> list= Arrays.asList(str.split(split));
    Comparator comparator = Collator.getInstance(Locale.CHINA);
    Collator collator = Collator.getInstance();
    list.sort(collator::compare);
    //list.stream().forEach(System.out::println);
    //加入页数   
    for(int i =0;i<list.size();i++){
      list.set(i,list.get(i)+" / "+page);
    }
     output.addAll(list);

  }

}
